Revit 2024 API
MEPSection.FixtureUnit Property
 The fixture unit of the section.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double FixtureUnit { get; }
Visual Basic
Public ReadOnly Property FixtureUnit As Double
	Get
Visual C++
public:
property double FixtureUnit {
	double get ();
}
Remarks
 In one section, all section members have same fixture unit. Fixture Unit is a number. The unit type is UT_Number.
See Also
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace